app/controllers/articles_controller.rb

  def destroy
    @article = Article.destroy(params[:id])
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 11]]